---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementTagOrientation
source: html/8cbdbfb2-84e0-c960-60bb-4d7db57181ca.htm
---
# Autodesk.Revit.DB.SpatialElementTagOrientation

An enumerated type listing tag orientation options that are supported by SpatialElementTags.

## Syntax (C#)
```csharp
public enum SpatialElementTagOrientation
```